// https://maxcode.dev/problems/islands-count/

function countIslands(grid){

}

const grid = [
    [0,0,0,0,0,0,0,0,0,0],
    [0,0,1,1,0,0,0,0,0,0],
    [0,0,1,1,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,1,0],
    [0,0,0,0,0,1,1,1,0,0],
    [1,1,0,0,0,0,0,0,0,0],
];

console.log(countIslands(grid)); // 3

// Если убрать нули и запятые, проще увидеть,
// что островов — три штуки.
//  [. . . . . . . . . .]
//  [. . 1 1 . . . . . .]
//  [. . 1 1 . . . . . .]
//  [. . . . . . . . 1 .]
//  [. . . . . 1 1 1 . .]
//  [1 1 . . . . . . . .]
